In [1]:
import pandas as pd
import numpy as np

import pathlib
from pathlib import Path
home_dir_path = pathlib.Path.home()

import datetime as dt
now = dt.datetime.now()

# Фильтрация отстутствуюищих данных

## Простое избавление от NaN

### Series

In [2]:
data = pd.Series([1, np.nan, 3.5, np.nan, 7])

In [3]:
data

0    1.0
1    NaN
2    3.5
3    NaN
4    7.0
dtype: float64

In [4]:
data = data.dropna()

In [5]:
data

0    1.0
2    3.5
4    7.0
dtype: float64

In [6]:
data.astype('int')

0    1
2    3
4    7
dtype: int64

In [7]:
data = pd.Series([1, np.nan, 3.5, np.nan, 7])

In [8]:
data[data.notnull()]

0    1.0
2    3.5
4    7.0
dtype: float64

### DataFrame

In [9]:
data = pd.DataFrame([[1, np.nan, 6.4, 8.8], [np.nan, 9.4, 8, np.nan], [8.5, 5, 6, 4.5], [np.nan, np.nan, np.nan, np.nan]])

In [10]:
data

     0    1    2    3
0  1.0  NaN  6.4  8.8
1  NaN  9.4  8.0  NaN
2  8.5  5.0  6.0  4.5
3  NaN  NaN  NaN  NaN

In [11]:
clened_all = data.dropna()

In [12]:
clened_all

     0    1    2    3
2  8.5  5.0  6.0  4.5

In [13]:
# Удаляет только полностью отсутствующие значения
data.dropna(how='all')

     0    1    2    3
0  1.0  NaN  6.4  8.8
1  NaN  9.4  8.0  NaN
2  8.5  5.0  6.0  4.5

In [14]:
data[4] = np.nan

In [15]:
data

     0    1    2    3   4
0  1.0  NaN  6.4  8.8 NaN
1  NaN  9.4  8.0  NaN NaN
2  8.5  5.0  6.0  4.5 NaN
3  NaN  NaN  NaN  NaN NaN

In [16]:
data.dropna(how='all', axis=1)

     0    1    2    3
0  1.0  NaN  6.4  8.8
1  NaN  9.4  8.0  NaN
2  8.5  5.0  6.0  4.5
3  NaN  NaN  NaN  NaN

In [17]:
df = pd.DataFrame(np.random.randn(7, 3))
df.iloc[:4, 1] = np.nan; df.iloc[:2, 2] = np.nan

In [18]:
df

          0         1         2
0  1.698787       NaN       NaN
1 -0.357137       NaN       NaN
2  0.454017       NaN -0.324473
3 -1.107124       NaN  1.022799
4 -0.082627  0.418458  0.518567
5 -0.036238  0.236611 -1.502606
6 -1.993486  0.434444 -0.418255

In [19]:
# Оставляет определенное кол-во наблюдений без NaN
df.dropna(thresh=3)

          0         1         2
4 -0.082627  0.418458  0.518567
5 -0.036238  0.236611 -1.502606
6 -1.993486  0.434444 -0.418255

# Замена отсутствующих данных

In [20]:
df.fillna(0)

          0         1         2
0  1.698787  0.000000  0.000000
1 -0.357137  0.000000  0.000000
2  0.454017  0.000000 -0.324473
3 -1.107124  0.000000  1.022799
4 -0.082627  0.418458  0.518567
5 -0.036238  0.236611 -1.502606
6 -1.993486  0.434444 -0.418255

In [21]:
data = pd.Series([1, np.nan, 3.5, np.nan, 7])
data

0    1.0
1    NaN
2    3.5
3    NaN
4    7.0
dtype: float64

In [22]:
data.fillna(data.mean())

0    1.000000
1    3.833333
2    3.500000
3    3.833333
4    7.000000
dtype: float64

In [23]:
df

          0         1         2
0  1.698787       NaN       NaN
1 -0.357137       NaN       NaN
2  0.454017       NaN -0.324473
3 -1.107124       NaN  1.022799
4 -0.082627  0.418458  0.518567
5 -0.036238  0.236611 -1.502606
6 -1.993486  0.434444 -0.418255

In [24]:
df.fillna(df.mean())

          0         1         2
0  1.698787  0.363171 -0.140794
1 -0.357137  0.363171 -0.140794
2  0.454017  0.363171 -0.324473
3 -1.107124  0.363171  1.022799
4 -0.082627  0.418458  0.518567
5 -0.036238  0.236611 -1.502606
6 -1.993486  0.434444 -0.418255

# Кореляция и ковариация

In [25]:
import pandas_datareader as web

In [26]:
all_data = {}
for ticker in ['AAPL', 'IBM', 'MSFT', 'GOOG']:
    all_data[ticker] = web.get_data_yahoo(ticker, '1/1/2000', '1/1/2021')

In [27]:
all_data

{'AAPL':                   High         Low        Open       Close       Volume  \
 Date
 2000-01-03    1.004464    0.907924    0.936384    0.999442  535796800.0
 2000-01-04    0.987723    0.903460    0.966518    0.915179  512377600.0
 2000-01-05    0.987165    0.919643    0.926339    0.928571  778321600.0
 2000-01-06    0.955357    0.848214    0.947545    0.848214  767972800.0
 2000-01-07    0.901786    0.852679    0.861607    0.888393  460734400.0
 ...                ...         ...         ...         ...          ...
 2020-12-24  133.460007  131.100006  131.320007  131.970001   54930100.0
 2020-12-28  137.339996  133.509995  133.990005  136.690002  124486200.0
 2020-12-29  138.789993  134.339996  138.050003  134.869995  121047300.0
 2020-12-30  135.990005  133.399994  135.580002  133.720001   96452100.0
 2020-12-31  134.740005  131.720001  134.080002  132.690002   99116600.0

              Adj Close
 Date
 2000-01-03    0.858137
 2000-01-04    0.785788
 2000-01-05    0.797286
 2000-01-06    0.728290
 2000-01-07    0.762789
 ...                ...
 2020-12-24  131.352829
 2020-12-28  136.050766
 2020-12-29  134.239273
 2020-12-30  133.094650
 2020-12-31  132.069473

 [5284 rows x 6 columns],
 'IBM':                   High         Low        Open       Close      Volume  \
 Date
 2000-01-03  116.000000  111.875000  112.437500  116.000000  10347700.0
 2000-01-04  114.500000  110.875000  114.000000  112.062500   8227800.0
 2000-01-05  119.750000  112.125000  112.937500  116.000000  12733200.0
 2000-01-06  118.937500  113.500000  118.000000  114.000000   7971900.0
 2000-01-07  117.937500  110.625000  117.250000  113.500000  11856700.0
 ...                ...         ...         ...         ...         ...
 2020-12-24  125.099998  124.209999  125.000000  124.690002   1761100.0
 2020-12-28  126.599998  124.459999  125.099998  124.820000   3615200.0
 2020-12-29  125.480003  123.239998  125.349998  123.800003   3487000.0
 2020-12-30  124.849998  123.629997  123.800003  124.339996   3380300.0
 2020-12-31  126.029999  123.989998  124.220001  125.879997   3574400.0

              Adj Close
 Date
 2000-01-03   71.265106
 2000-01-04   68.846115
 2000-01-05   71.265106
 2000-01-06   70.036453
 2000-01-07   69.729233
 ...                ...
 2020-12-24  120.301132
 2020-12-28  120.426552
 2020-12-29  119.442459
 2020-12-30  119.963455
 2020-12-31  121.449249

 [5284 rows x 6 columns],
 'MSFT':                   High         Low        Open       Close      Volume  \
 Date
 2000-01-03   59.312500   56.000000   58.687500   58.281250  53228400.0
 2000-01-04   58.562500   56.125000   56.781250   56.312500  54119000.0
 2000-01-05   58.187500   54.687500   55.562500   56.906250  64059600.0
 2000-01-06   56.937500   54.187500   56.093750   55.000000  54976600.0
 2000-01-07   56.125000   53.656250   54.312500   55.718750  62013600.0
 ...                ...         ...         ...         ...         ...
 2020-12-24  223.610001  221.199997  221.419998  222.750000  10550600.0
 2020-12-28  226.029999  223.020004  224.449997  224.960007  17933500.0
 2020-12-29  227.179993  223.580002  226.309998  224.149994  17403200.0
 2020-12-30  225.630005  221.470001  225.229996  221.679993  20272300.0
 2020-12-31  223.000000  219.679993  221.699997  222.419998  20942100.0

              Adj Close
 Date
 2000-01-03   36.861511
 2000-01-04   35.616341
 2000-01-05   35.991871
 2000-01-06   34.786209
 2000-01-07   35.240803
 ...                ...
 2020-12-24  221.302505
 2020-12-28  223.498123
 2020-12-29  222.693390
 2020-12-30  220.239441
 2020-12-31  220.974640

 [5284 rows x 6 columns],
 'GOOG':                    High          Low         Open        Close      Volume  \
 Date
 2004-08-19    51.835709    47.800831    49.813290    49.982655  44871361.0
 2004-08-20    54.336334    50.062355    50.316402    53.952770  22942874.0
 2004-08-23    56.528118    54.321388    55.168217    54.495735  18342897.0
 2004-08-24    55.591629    51.591621    55.412300    52.239197  15319808.0
 2004-08-25    53.798351    51.746044    52.284027    52.802086   9232276.0
 ...                 ...          ...          ...          ...         ...
 2020-12-24  1746.000000  1729.109985  1735.000000  1738.849976    346800.0
 2020-12-28  1790.728027  1746.334961  1751.635010  1776.089966   1393000.0
 2020-12-29  1792.439941  1756.089966  1787.790039  1758.719971   1299400.0
 2020-12-30  1765.094971  1725.599976  1762.010010  1739.520020   1306100.0
 2020-12-31  1758.930054  1735.420044  1735.420044  1751.880005   1011900.0

               Adj Close
 Date
 2004-08-19    49.982655
 2004-08-20    53.952770
 2004-08-23    54.495735
 2004-08-24    52.239197
 2004-08-25    52.802086
 ...                 ...
 2020-12-24  1738.849976
 2020-12-28  1776.089966
 2020-12-29  1758.719971
 2020-12-30  1739.520020
 2020-12-31  1751.880005

 [4122 rows x 6 columns]}

In [28]:
price = pd.DataFrame({tic: data['Adj Close']
                      for tic, data in all_data.items()})

In [29]:
volume = pd.DataFrame({tic: data['Volume']
                      for tic, data in all_data.items()})

In [30]:
price

                  AAPL         IBM        MSFT         GOOG
Date
2000-01-03    0.858137   71.265106   36.861511          NaN
2000-01-04    0.785788   68.846115   35.616341          NaN
2000-01-05    0.797286   71.265106   35.991871          NaN
2000-01-06    0.728290   70.036453   34.786209          NaN
2000-01-07    0.762789   69.729233   35.240803          NaN
...                ...         ...         ...          ...
2020-12-24  131.352829  120.301132  221.302505  1738.849976
2020-12-28  136.050766  120.426552  223.498123  1776.089966
2020-12-29  134.239273  119.442459  222.693390  1758.719971
2020-12-30  133.094650  119.963455  220.239441  1739.520020
2020-12-31  132.069473  121.449249  220.974640  1751.880005

[5284 rows x 4 columns]

In [31]:
# Процентное изменение цен
returns = price.pct_change()

In [32]:
returns.head()

                AAPL       IBM      MSFT  GOOG
Date
2000-01-03       NaN       NaN       NaN   NaN
2000-01-04 -0.084310 -0.033944 -0.033780   NaN
2000-01-05  0.014633  0.035136  0.010544   NaN
2000-01-06 -0.086538 -0.017241 -0.033498   NaN
2000-01-07  0.047369 -0.004387  0.013068   NaN

In [33]:
returns.tail()

                AAPL       IBM      MSFT      GOOG
Date
2020-12-24  0.007712  0.006376  0.007827  0.003735
2020-12-28  0.035766  0.001043  0.009921  0.021416
2020-12-29 -0.013315 -0.008172 -0.003601 -0.009780
2020-12-30 -0.008527  0.004362 -0.011019 -0.010917
2020-12-31 -0.007703  0.012385  0.003338  0.007105

In [34]:
# Series
print(returns.AAPL.corr(returns.GOOG), returns.AAPL.cov(returns.GOOG))

0.4981563541965235 0.00020320224622694677

In [35]:
# DF
returns.corr()

          AAPL       IBM      MSFT      GOOG
AAPL  1.000000  0.414643  0.461320  0.498156
IBM   0.414643  1.000000  0.509293  0.427499
MSFT  0.461320  0.509293  1.000000  0.530478
GOOG  0.498156  0.427499  0.530478  1.000000

In [36]:
returns.cov()

          AAPL       IBM      MSFT      GOOG
AAPL  0.000655  0.000177  0.000230  0.000203
IBM   0.000177  0.000279  0.000166  0.000119
MSFT  0.000230  0.000166  0.000380  0.000175
GOOG  0.000203  0.000119  0.000175  0.000371

In [37]:
# Попарные корелляциии и ковариации между столбцами DF
returns.corrwith(returns.GOOG)

AAPL    0.498156
IBM     0.427499
MSFT    0.530478
GOOG    1.000000
dtype: float64

In [38]:
# Корелляция процентного измениния стоимости к объему сделок
# exis=1 вычисление корреляции строк
returns.corrwith(volume)

AAPL   -0.052659
IBM    -0.048165
MSFT   -0.044805
GOOG    0.041153
dtype: float64

# Уникальные значения

In [39]:
obj = pd.Series(['c', 'a', 'd', 'a', 'a', 'b', 'b', 'c', 'c'])

In [40]:
unique = obj.unique()

In [41]:
unique

array(['c', 'a', 'd', 'b'], dtype=object)

In [42]:
unique.sort()

In [43]:
unique

array(['a', 'b', 'c', 'd'], dtype=object)

In [44]:
pd.value_counts(obj.values, sort=False)

d    1
a    3
b    2
c    3
dtype: int64

In [45]:
mask = obj.isin(['b', 'c'])

In [46]:
mask

0     True
1    False
2    False
3    False
4    False
5     True
6     True
7     True
8     True
dtype: bool

In [47]:
obj.mask

<bound method NDFrame.mask of 0    c
1    a
2    d
3    a
4    a
5    b
6    b
7    c
8    c
dtype: object>

# Комбинирование и слияние наборов данных

## Многие к одному

In [48]:
df1 = pd.DataFrame({'key': ['b', 'b', 'a', 'c', 'a', 'a', 'b'], 'data1': range(7)}) 
df2 = pd.DataFrame({'key': ['a', 'b', 'd'], 'data2': range(3)})

In [49]:
df1

  key  data1
0   b      0
1   b      1
2   a      2
3   c      3
4   a      4
5   a      5
6   b      6

In [50]:
df2

  key  data2
0   a      0
1   b      1
2   d      2

In [51]:
pd.merge(df1, df2, on='key')

  key  data1  data2
0   b      0      1
1   b      1      1
2   b      6      1
3   a      2      0
4   a      4      0
5   a      5      0

In [52]:
df3 = pd.DataFrame({'lkey': ['b', 'b', 'a', 'c', 'a', 'a', 'b'], 'data1': range(7)})
df4 = pd.DataFrame({'rkey': ['a', 'b', 'd'], 'data2': range(3)})

In [53]:
df3

  lkey  data1
0    b      0
1    b      1
2    a      2
3    c      3
4    a      4
5    a      5
6    b      6

In [54]:
df4

  rkey  data2
0    a      0
1    b      1
2    d      2

In [55]:
pd.merge(df3, df4, left_on = 'lkey', right_on = 'rkey')

  lkey  data1 rkey  data2
0    b      0    b      1
1    b      1    b      1
2    b      6    b      1
3    a      2    a      0
4    a      4    a      0
5    a      5    a      0

In [56]:
pd.merge(df1, df2, how = 'outer')

  key  data1  data2
0   b    0.0    1.0
1   b    1.0    1.0
2   b    6.0    1.0
3   a    2.0    0.0
4   a    4.0    0.0
5   a    5.0    0.0
6   c    3.0    NaN
7   d    NaN    2.0

## Многие ко многим

In [57]:
df1 = pd.DataFrame({'key': ['b', 'b', 'a', 'c', 'a', 'b'], 'data1': range(6)})
df2 = pd.DataFrame({'key': ['a', 'b', 'a', 'b', 'd'], 'data2': range(5)})

In [58]:
df1

  key  data1
0   b      0
1   b      1
2   a      2
3   c      3
4   a      4
5   b      5

In [59]:
df2

  key  data2
0   a      0
1   b      1
2   a      2
3   b      3
4   d      4

In [60]:
pd.merge(df1, df2, on = 'key', how = 'left')

   key  data1  data2
0    b      0    1.0
1    b      0    3.0
2    b      1    1.0
3    b      1    3.0
4    a      2    0.0
5    a      2    2.0
6    c      3    NaN
7    a      4    0.0
8    a      4    2.0
9    b      5    1.0
10   b      5    3.0

In [61]:
pd.merge(df1, df2, how = 'inner')

  key  data1  data2
0   b      0      1
1   b      0      3
2   b      1      1
3   b      1      3
4   b      5      1
5   b      5      3
6   a      2      0
7   a      2      2
8   a      4      0
9   a      4      2

## Слияние по нескольким ключам

In [62]:
left = pd.DataFrame({'key1': ['foo', 'foo', 'bar'], 
                    'key2': ['one', 'two', 'one'], 
                    'lval': [1, 2, 3]})
right = pd.DataFrame({'key1': ['foo', 'foo', 'bar', 'bar'],
                          'key2': ['one', 'one', 'one', 'two'], 
                          'rval': [4, 5, 6, 7]})

In [63]:
left

  key1 key2  lval
0  foo  one     1
1  foo  two     2
2  bar  one     3

In [64]:
right

  key1 key2  rval
0  foo  one     4
1  foo  one     5
2  bar  one     6
3  bar  two     7

In [65]:
pd.merge(left, right, on = ['key1','key2'], how = 'outer')

  key1 key2  lval  rval
0  foo  one   1.0   4.0
1  foo  one   1.0   5.0
2  foo  two   2.0   NaN
3  bar  one   3.0   6.0
4  bar  two   NaN   7.0

In [66]:
pd.merge(left, right, on = 'key1')

  key1 key2_x  lval key2_y  rval
0  foo    one     1    one     4
1  foo    one     1    one     5
2  foo    two     2    one     4
3  foo    two     2    one     5
4  bar    one     3    one     6
5  bar    one     3    two     7

## Слияние по индексу

In [67]:
left1 = pd.DataFrame({'key': ['a', 'b', 'a', 'a', 'b', 'c'], 'value': range(6)})
right1 = pd.DataFrame({'group_val': [3.5, 7]}, index=['a', 'b'])

In [68]:
left1

  key  value
0   a      0
1   b      1
2   a      2
3   a      3
4   b      4
5   c      5

In [69]:
right1

   group_val
a        3.5
b        7.0

In [70]:
pd.merge(left1, right1, left_on = 'key', right_index = True)

  key  value  group_val
0   a      0        3.5
2   a      2        3.5
3   a      3        3.5
1   b      1        7.0
4   b      4        7.0

In [71]:
pd.merge(left1, right1, left_on = 'key', right_index = True, how = 'outer')

  key  value  group_val
0   a      0        3.5
2   a      2        3.5
3   a      3        3.5
1   b      1        7.0
4   b      4        7.0
5   c      5        NaN

### Иерархические индексы

In [77]:
left = pd.DataFrame({'key1': ['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada'],
                   'key2': [2000, 2001, 2002, 2001, 2002], 
                   'data': np.arange(5.)})
righth = pd.DataFrame(np.arange(12).reshape((6, 2)), 
                   index=[['Nevada', 'Nevada', 'Ohio', 'Ohio', 'Ohio', 'Ohio'], 
                          [2001, 2000, 2000, 2000, 2001, 2002]], 
                   columns=['event1', 'event2'])

In [81]:
lefth

     key1  key2  data
0    Ohio  2000   0.0
1    Ohio  2001   1.0
2    Ohio  2002   2.0
3  Nevada  2001   3.0
4  Nevada  2002   4.0

In [79]:
righth

             event1  event2
Nevada 2001       0       1
       2000       2       3
Ohio   2000       4       5
       2000       6       7
       2001       8       9
       2002      10      11

In [85]:
pd.merge(lefth, righth, left_on = ['key1', 'key2'], right_index = True)

     key1  key2  data  event1  event2
0    Ohio  2000   0.0       4       5
0    Ohio  2000   0.0       6       7
1    Ohio  2001   1.0       8       9
2    Ohio  2002   2.0      10      11
3  Nevada  2001   3.0       0       1

In [87]:
pd.merge(lefth, righth, left_on = ['key1', 'key2'], right_index = True, how = 'outer')

     key1  key2  data  event1  event2
0    Ohio  2000   0.0     4.0     5.0
0    Ohio  2000   0.0     6.0     7.0
1    Ohio  2001   1.0     8.0     9.0
2    Ohio  2002   2.0    10.0    11.0
3  Nevada  2001   3.0     0.0     1.0
4  Nevada  2002   4.0     NaN     NaN
4  Nevada  2000   NaN     2.0     3.0

In [88]:
left2 = pd.DataFrame([[1., 2.], [3., 4.], [5., 6.]], 
                     index=['a', 'c', 'e'], 
                     columns=['Ohio', 'Nevada'])
right2 = pd.DataFrame([[7., 8.], [9., 10.], [11., 12.], [13, 14]], 
                      index=['b', 'c', 'd', 'e'], 
                      columns=['Missouri', 'Alabama'])

In [89]:
left2

   Ohio  Nevada
a   1.0     2.0
c   3.0     4.0
e   5.0     6.0

In [90]:
right2

   Missouri  Alabama
b       7.0      8.0
c       9.0     10.0
d      11.0     12.0
e      13.0     14.0

In [91]:
pd.merge(left2, right2, how = 'outer', left_index = True, right_index= True)

   Ohio  Nevada  Missouri  Alabama
a   1.0     2.0       NaN      NaN
b   NaN     NaN       7.0      8.0
c   3.0     4.0       9.0     10.0
d   NaN     NaN      11.0     12.0
e   5.0     6.0      13.0     14.0

##  Конкатенация вдоль оси